# BuiltInFailures.CutterFailures Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..CutterFailures Properties
BuiltInFailures..::..CutterFailures Class See Also
---
The BuiltInFailures..::..CutterFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| MakeCutterForPlanRegionsGStepFailed | Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions. |
| MakeCutterForSectionGStepFailed | Attempt to create or manipulate a segmented section has failed. |

# See Also
BuiltInFailures..::..CutterFailures Class
Autodesk.Revit.DB Namespace